MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0L1054CFL/mcu.h
/* ==========================================================  CKS  ========================================================== */
 #define R_PCLBUZ_CKS_CCS_Pos      (0UL)    /*!< CCS (Bit 0)                                           */
 #define R_PCLBUZ_CKS_CCS_Msk      (0x7UL)  /*!< CCS (Bitfield-Mask: 0x07)                             */
 #define R_PCLBUZ_CKS_CSEL_Pos     (3UL)    /*!< CSEL (Bit 3)                                          */
 #define R_PCLBUZ_CKS_CSEL_Msk     (0x8UL)  /*!< CSEL (Bitfield-Mask: 0x01)                            */
 #define R_PCLBUZ_CKS_PCLOE_Pos    (7UL)    /*!< PCLOE (Bit 7)                                         */
 #define R_PCLBUZ_CKS_PCLOE_Msk    (0x80UL) /*!< PCLOE (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                          R_PORT0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  PODR  ========================================================== */
 #define R_PORT0_PODR_PODR_Pos    (0UL)   /*!< PODR (Bit 0)                                          */
 #define R_PORT0_PODR_PODR_Msk    (0x1UL) /*!< PODR (Bitfield-Mask: 0x01)                            */
/* ==========================================================  PDR  ========================================================== */
 #define R_PORT0_PDR_PDR_Pos      (0UL)   /*!< PDR (Bit 0)                                           */
 #define R_PORT0_PDR_PDR_Msk      (0x1UL) /*!< PDR (Bitfield-Mask: 0x01)                             */
/* =========================================================  PIDR  ========================================================== */
 #define R_PORT0_PIDR_PIDR_Pos    (0UL)   /*!< PIDR (Bit 0)                                          */
 #define R_PORT0_PIDR_PIDR_Msk    (0x1UL) /*!< PIDR (Bitfield-Mask: 0x01)                            */
/* =========================================================  PORR  ========================================================== */
 #define R_PORT0_PORR_PORR_Pos    (0UL)   /*!< PORR (Bit 0)                                          */
 #define R_PORT0_PORR_PORR_Msk    (0x1UL) /*!< PORR (Bitfield-Mask: 0x01)                            */
/* =========================================================  POSR  ========================================================== */
 #define R_PORT0_POSR_POSR_Pos    (0UL)   /*!< POSR (Bit 0)                                          */
 #define R_PORT0_POSR_POSR_Msk    (0x1UL) /*!< POSR (Bitfield-Mask: 0x01)                            */
/* =========================================================  EORR  ========================================================== */
 #define R_PORT0_EORR_EORR_Pos    (0UL)   /*!< EORR (Bit 0)                                          */
 #define R_PORT0_EORR_EORR_Msk    (0x1UL) /*!< EORR (Bitfield-Mask: 0x01)                            */
/* =========================================================  EOSR  ========================================================== */
 #define R_PORT0_EOSR_EOSR_Pos    (0UL)   /*!< EOSR (Bit 0)                                          */
 #define R_PORT0_EOSR_EOSR_Msk    (0x1UL) /*!< EOSR (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                          R_PORGA                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  SNFEN  ========================================================= */
 #define R_PORGA_SNFEN_SNFEN00_Pos    (0UL)    /*!< SNFEN00 (Bit 0)                                       */
 #define R_PORGA_SNFEN_SNFEN00_Msk    (0x1UL)  /*!< SNFEN00 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_SNFEN_SNFEN10_Pos    (2UL)    /*!< SNFEN10 (Bit 2)                                       */
 #define R_PORGA_SNFEN_SNFEN10_Msk    (0x4UL)  /*!< SNFEN10 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_SNFEN_SNFEN20_Pos    (4UL)    /*!< SNFEN20 (Bit 4)                                       */
 #define R_PORGA_SNFEN_SNFEN20_Msk    (0x10UL) /*!< SNFEN20 (Bitfield-Mask: 0x01)                         */
/* =========================================================  TNFEN  ========================================================= */
 #define R_PORGA_TNFEN_TNFEN00_Pos    (0UL)    /*!< TNFEN00 (Bit 0)                                       */
 #define R_PORGA_TNFEN_TNFEN00_Msk    (0x1UL)  /*!< TNFEN00 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN01_Pos    (1UL)    /*!< TNFEN01 (Bit 1)                                       */
 #define R_PORGA_TNFEN_TNFEN01_Msk    (0x2UL)  /*!< TNFEN01 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN02_Pos    (2UL)    /*!< TNFEN02 (Bit 2)                                       */
 #define R_PORGA_TNFEN_TNFEN02_Msk    (0x4UL)  /*!< TNFEN02 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN03_Pos    (3UL)    /*!< TNFEN03 (Bit 3)                                       */
 #define R_PORGA_TNFEN_TNFEN03_Msk    (0x8UL)  /*!< TNFEN03 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN04_Pos    (4UL)    /*!< TNFEN04 (Bit 4)                                       */
 #define R_PORGA_TNFEN_TNFEN04_Msk    (0x10UL) /*!< TNFEN04 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN05_Pos    (5UL)    /*!< TNFEN05 (Bit 5)                                       */
 #define R_PORGA_TNFEN_TNFEN05_Msk    (0x20UL) /*!< TNFEN05 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN06_Pos    (6UL)    /*!< TNFEN06 (Bit 6)                                       */
 #define R_PORGA_TNFEN_TNFEN06_Msk    (0x40UL) /*!< TNFEN06 (Bitfield-Mask: 0x01)                         */
 #define R_PORGA_TNFEN_TNFEN07_Pos    (7UL)    /*!< TNFEN07 (Bit 7)                                       */
 #define R_PORGA_TNFEN_TNFEN07_Msk    (0x80UL) /*!< TNFEN07 (Bitfield-Mask: 0x01)                         */
/* ==========================================================  ISC  ========================================================== */
 #define R_PORGA_ISC_ISC0_Pos         (0UL)    /*!< ISC0 (Bit 0)                                          */
 #define R_PORGA_ISC_ISC0_Msk         (0x1UL)  /*!< ISC0 (Bitfield-Mask: 0x01)                            */
 #define R_PORGA_ISC_ISC1_Pos         (1UL)    /*!< ISC1 (Bit 1)                                          */
 #define R_PORGA_ISC_ISC1_Msk         (0x2UL)  /*!< ISC1 (Bitfield-Mask: 0x01)                            */
 #define R_PORGA_ISC_SSIE00_Pos       (2UL)    /*!< SSIE00 (Bit 2)                                        */
 #define R_PORGA_ISC_SSIE00_Msk       (0x4UL)  /*!< SSIE00 (Bitfield-Mask: 0x01)                          */
/* =========================================================  TIS0  ========================================================== */
 #define R_PORGA_TIS0_TIS_Pos         (0UL)    /*!< TIS (Bit 0)                                           */
 #define R_PORGA_TIS0_TIS_Msk         (0x7UL)  /*!< TIS (Bitfield-Mask: 0x07)                             */
/* =========================================================  TIS1  ========================================================== */
 #define R_PORGA_TIS1_TIS0_Pos        (0UL)    /*!< TIS0 (Bit 0)                                          */
 #define R_PORGA_TIS1_TIS0_Msk        (0x1UL)  /*!< TIS0 (Bitfield-Mask: 0x01)                            */
 #define R_PORGA_TIS1_TIS1_Pos        (1UL)    /*!< TIS1 (Bit 1)                                          */
 #define R_PORGA_TIS1_TIS1_Msk        (0x2UL)  /*!< TIS1 (Bitfield-Mask: 0x01)                            */
/* =========================================================  ULBS  ========================================================== */
 #define R_PORGA_ULBS_ULBS0_Pos       (0UL)    /*!< ULBS0 (Bit 0)                                         */
 #define R_PORGA_ULBS_ULBS0_Msk       (0x1UL)  /*!< ULBS0 (Bitfield-Mask: 0x01)                           */
 #define R_PORGA_ULBS_ULBS1_Pos       (1UL)    /*!< ULBS1 (Bit 1)                                         */
 #define R_PORGA_ULBS_ULBS1_Msk       (0x2UL)  /*!< ULBS1 (Bitfield-Mask: 0x01)                           */
 #define R_PORGA_ULBS_ULBS2_Pos       (2UL)    /*!< ULBS2 (Bit 2)                                         */
 #define R_PORGA_ULBS_ULBS2_Msk       (0x4UL)  /*!< ULBS2 (Bitfield-Mask: 0x01)                           */
 #define R_PORGA_ULBS_ULBS4_Pos       (4UL)    /*!< ULBS4 (Bit 4)                                         */
 #define R_PORGA_ULBS_ULBS4_Msk       (0x10UL) /*!< ULBS4 (Bitfield-Mask: 0x01)                           */
 #define R_PORGA_ULBS_ULBS5_Pos       (5UL)    /*!< ULBS5 (Bit 5)                                         */
 #define R_PORGA_ULBS_ULBS5_Msk       (0x20UL) /*!< ULBS5 (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CCS  ========================================================== */
 #define R_PORGA_CCS_SET_Pos          (0UL)    /*!< SET (Bit 0)                                           */
 #define R_PORGA_CCS_SET_Msk          (0x7UL)  /*!< SET (Bitfield-Mask: 0x07)                             */
/* =========================================================  CCDE  ========================================================== */
 #define R_PORGA_CCDE_EN_Pos          (0UL)    /*!< EN (Bit 0)                                            */
 #define R_PORGA_CCDE_EN_Msk          (0x1UL)  /*!< EN (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                           R_PFS                                           ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                          R_PMISC                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  PWPR  ========================================================== */
 #define R_PMISC_PWPR_PFSWE_Pos    (6UL)    /*!< PFSWE (Bit 6)                                         */
 #define R_PMISC_PWPR_PFSWE_Msk    (0x40UL) /*!< PFSWE (Bitfield-Mask: 0x01)                           */
 #define R_PMISC_PWPR_B0WI_Pos     (7UL)    /*!< B0WI (Bit 7)                                          */
 #define R_PMISC_PWPR_B0WI_Msk     (0x80UL) /*!< B0WI (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                          R_SAU0                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  SDR  ========================================================== */
 #define R_SAU0_SDR_DAT_Pos      (0UL)      /*!< DAT (Bit 0)                                           */
 #define R_SAU0_SDR_DAT_Msk      (0x1ffUL)  /*!< DAT (Bitfield-Mask: 0x1ff)                            */
 #define R_SAU0_SDR_STCLK_Pos    (9UL)      /*!< STCLK (Bit 9)                                         */
 #define R_SAU0_SDR_STCLK_Msk    (0xfe00UL) /*!< STCLK (Bitfield-Mask: 0x7f)                           */
/* ==========================================================  SSR  ========================================================== */
 #define R_SAU0_SSR_OVF_Pos      (0UL)      /*!< OVF (Bit 0)                                           */
 #define R_SAU0_SSR_OVF_Msk      (0x1UL)    /*!< OVF (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SSR_PEF_Pos      (1UL)      /*!< PEF (Bit 1)                                           */
 #define R_SAU0_SSR_PEF_Msk      (0x2UL)    /*!< PEF (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SSR_FEF_Pos      (2UL)      /*!< FEF (Bit 2)                                           */
 #define R_SAU0_SSR_FEF_Msk      (0x4UL)    /*!< FEF (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SSR_BFF_Pos      (5UL)      /*!< BFF (Bit 5)                                           */
 #define R_SAU0_SSR_BFF_Msk      (0x20UL)   /*!< BFF (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SSR_TSF_Pos      (6UL)      /*!< TSF (Bit 6)                                           */
 #define R_SAU0_SSR_TSF_Msk      (0x40UL)   /*!< TSF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  SIR  ========================================================== */
 #define R_SAU0_SIR_OVCT_Pos     (0UL)      /*!< OVCT (Bit 0)                                          */
 #define R_SAU0_SIR_OVCT_Msk     (0x1UL)    /*!< OVCT (Bitfield-Mask: 0x01)                            */
 #define R_SAU0_SIR_PECT_Pos     (1UL)      /*!< PECT (Bit 1)                                          */
 #define R_SAU0_SIR_PECT_Msk     (0x2UL)    /*!< PECT (Bitfield-Mask: 0x01)                            */
 #define R_SAU0_SIR_FECT_Pos     (2UL)      /*!< FECT (Bit 2)                                          */
 #define R_SAU0_SIR_FECT_Msk     (0x4UL)    /*!< FECT (Bitfield-Mask: 0x01)                            */
/* ==========================================================  SMR  ========================================================== */
 #define R_SAU0_SMR_MD0_Pos      (0UL)      /*!< MD0 (Bit 0)                                           */
 #define R_SAU0_SMR_MD0_Msk      (0x1UL)    /*!< MD0 (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SMR_MD1_Pos      (1UL)      /*!< MD1 (Bit 1)                                           */
 #define R_SAU0_SMR_MD1_Msk      (0x6UL)    /*!< MD1 (Bitfield-Mask: 0x03)                             */
 #define R_SAU0_SMR_SIS0_Pos     (6UL)      /*!< SIS0 (Bit 6)                                          */
 #define R_SAU0_SMR_SIS0_Msk     (0x40UL)   /*!< SIS0 (Bitfield-Mask: 0x01)                            */
 #define R_SAU0_SMR_STS_Pos      (8UL)      /*!< STS (Bit 8)                                           */
 #define R_SAU0_SMR_STS_Msk      (0x100UL)  /*!< STS (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SMR_CCS_Pos      (14UL)     /*!< CCS (Bit 14)                                          */
 #define R_SAU0_SMR_CCS_Msk      (0x4000UL) /*!< CCS (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SMR_CKS_Pos      (15UL)     /*!< CKS (Bit 15)                                          */
 #define R_SAU0_SMR_CKS_Msk      (0x8000UL) /*!< CKS (Bitfield-Mask: 0x01)                             */
/* ==========================================================  SCR  ========================================================== */
 #define R_SAU0_SCR_DLS_Pos      (0UL)      /*!< DLS (Bit 0)                                           */
 #define R_SAU0_SCR_DLS_Msk      (0x3UL)    /*!< DLS (Bitfield-Mask: 0x03)                             */
 #define R_SAU0_SCR_SLC_Pos      (4UL)      /*!< SLC (Bit 4)                                           */
 #define R_SAU0_SCR_SLC_Msk      (0x30UL)   /*!< SLC (Bitfield-Mask: 0x03)                             */
 #define R_SAU0_SCR_DIR_Pos      (7UL)      /*!< DIR (Bit 7)                                           */
 #define R_SAU0_SCR_DIR_Msk      (0x80UL)   /*!< DIR (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SCR_PTC_Pos      (8UL)      /*!< PTC (Bit 8)                                           */
 #define R_SAU0_SCR_PTC_Msk      (0x300UL)  /*!< PTC (Bitfield-Mask: 0x03)                             */
 #define R_SAU0_SCR_EOC_Pos      (10UL)     /*!< EOC (Bit 10)                                          */
 #define R_SAU0_SCR_EOC_Msk      (0x400UL)  /*!< EOC (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SCR_DCP_Pos      (12UL)     /*!< DCP (Bit 12)                                          */
 #define R_SAU0_SCR_DCP_Msk      (0x3000UL) /*!< DCP (Bitfield-Mask: 0x03)                             */
 #define R_SAU0_SCR_TRXE_Pos     (14UL)     /*!< TRXE (Bit 14)                                         */
 #define R_SAU0_SCR_TRXE_Msk     (0xc000UL) /*!< TRXE (Bitfield-Mask: 0x03)                            */
/* ==========================================================  SE  =========================================================== */
 #define R_SAU0_SE_SE_Pos        (0UL)      /*!< SE (Bit 0)                                            */
 #define R_SAU0_SE_SE_Msk        (0xfUL)    /*!< SE (Bitfield-Mask: 0x0f)                              */
/* ==========================================================  SS  =========================================================== */
 #define R_SAU0_SS_SS_Pos        (0UL)      /*!< SS (Bit 0)                                            */
 #define R_SAU0_SS_SS_Msk        (0xfUL)    /*!< SS (Bitfield-Mask: 0x0f)                              */
/* ==========================================================  ST  =========================================================== */
 #define R_SAU0_ST_ST_Pos        (0UL)      /*!< ST (Bit 0)                                            */
 #define R_SAU0_ST_ST_Msk        (0xfUL)    /*!< ST (Bitfield-Mask: 0x0f)                              */
/* ==========================================================  SPS  ========================================================== */
 #define R_SAU0_SPS_PRS0_Pos     (0UL)      /*!< PRS0 (Bit 0)                                          */
 #define R_SAU0_SPS_PRS0_Msk     (0xfUL)    /*!< PRS0 (Bitfield-Mask: 0x0f)                            */
 #define R_SAU0_SPS_PRS1_Pos     (4UL)      /*!< PRS1 (Bit 4)                                          */
 #define R_SAU0_SPS_PRS1_Msk     (0xf0UL)   /*!< PRS1 (Bitfield-Mask: 0x0f)                            */
/* ==========================================================  SO  =========================================================== */
 #define R_SAU0_SO_SO_Pos        (0UL)      /*!< SO (Bit 0)                                            */
 #define R_SAU0_SO_SO_Msk        (0xfUL)    /*!< SO (Bitfield-Mask: 0x0f)                              */
 #define R_SAU0_SO_CKO_Pos       (8UL)      /*!< CKO (Bit 8)                                           */
 #define R_SAU0_SO_CKO_Msk       (0xf00UL)  /*!< CKO (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  SOE  ========================================================== */
 #define R_SAU0_SOE_SOE_Pos      (0UL)      /*!< SOE (Bit 0)                                           */
 #define R_SAU0_SOE_SOE_Msk      (0xfUL)    /*!< SOE (Bitfield-Mask: 0x0f)                             */
/* ==========================================================  SOL  ========================================================== */
 #define R_SAU0_SOL_SOL_Pos      (0UL)      /*!< SOL (Bit 0)                                           */
 #define R_SAU0_SOL_SOL_Msk      (0x1UL)    /*!< SOL (Bitfield-Mask: 0x01)                             */
/* ==========================================================  SSC  ========================================================== */
 #define R_SAU0_SSC_SWC_Pos      (0UL)      /*!< SWC (Bit 0)                                           */
 #define R_SAU0_SSC_SWC_Msk      (0x1UL)    /*!< SWC (Bitfield-Mask: 0x01)                             */
 #define R_SAU0_SSC_SSEC_Pos     (1UL)      /*!< SSEC (Bit 1)                                          */
 #define R_SAU0_SSC_SSEC_Msk     (0x2UL)    /*!< SSEC (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                          R_SRAM                                           ================ */
/* =========================================================================================================================== */

